/**
 * На вход некоторому исполнителю подаётся два числа (a, b).
 * У исполнителя есть две команды
 * - команда 1 (к1): увеличить а в с раз, а умножается на c
 * - команда 2 (к2): увеличить на d, к a прибавляется d
 * Написать программу, которая выдаёт набор команд, позволяющий число a
 * превратить в число b или сообщить, что это невозможно.
 * Можно начать с более простого – просто подсчёта общего количества вариантов
 * Подумать над тем, как сделать минимальное количество команд
 * 
 * Пример 1: а = 1, b = 7, c = 2, d = 1
 * ответ: к2, к2, к2, к2, к2, к2, k2 или к1, к1, к2, к2, к2
 * 
 * Пример 2: а = 11, b = 7, c = 2, d = 1
 * ответ: нет решения.
 * 
 */

public class task {

  // 1. Получение данных от пользователя
  public static void main(String[] args) {
    int a = Library.getNumberByUser("Введите число a: ");
    int b = Library.getNumberByUser("Введите число b: ");
    int c = Library.getNumberByUser("Введите число c: ");
    int d = Library.getNumberByUser("Введите число d: ");

  }

}
